{
    "about": {
        "navSkills": "Skills",
        "navProjects": "Projects",
        "navContact": "Contact",
        "homeHi": "Hi I'm a  ",
        "homeMarked": "Full Stack",
        "homeLeading": "developer creating modern web apps.",
        "homeDescription": "A full stack developer based in the Brazil. I'm passionate about building modern web applications using Next.js e Node.js.",
        "homeButtonText": "My Skills",
        "projectTitleSection": "My Projects",
        "coffeDescription": "Online specialty coffee store built with React. Responsive interface with payment integration and data validation.",
        "cobaltDescription": "Landing page for an investment company built with React. Performance-optimized page focused on lead conversion.",
        "droneDescription": "Drone store landing page built with React. Attractive interface with high conversion rate and easy navigation.",
        "appleDescription": "Apple website redesign maintaining brand identity. Modern interface with fast loading and improved user experience.",
        "raryDescription": "Corporate website for Rary Service built with Next.js and Tailwind. Scalable application with SEO optimization, authentication, and Vercel deployment.",
        "safetyQrDescription": "Industrial safety application with QR codes on helmets. Quick access to vital information in emergencies, reducing reaction time and fatalities.",
        "mealTrackerDescription":"Meal tracking platform with dashboard, automatic calorie calculation, and statistics. Google authentication using AuthJS.",
        "rarySituation": "Rary Service needed a modern and professional corporate website to represent their brand online, with requirements for optimized SEO, user authentication, and a scalable architecture.",
        "raryTask": "Develop a complete web application that met modern design, performance, SEO, and security requirements, using cutting-edge technologies from the React ecosystem.",
        "raryAction": "I implemented the site using Next.js with App Router, Tailwind CSS for responsive styling, configured secure authentication, optimized for SEO with dynamic meta tags, and deployed to Vercel for maximum performance and scalability.",
        "raryResult": "Corporate website successfully delivered, achieving excellent performance, optimized SEO, and a modern user experience that professionally represents the Rary Service brand.",
        "safetyQrSituation": "The industry needs a fast and efficient system to access vital safety information in emergency situations, where seconds can mean the difference between life and death.",
        "safetyQrTask": "Create a solution that allows instant access to safety information through QR codes on helmets, reducing response time in emergencies.",
        "safetyQrAction": "I developed a web application that generates unique QR codes for each helmet, enabling quick smartphone access to critical data such as allergies, emergency contacts, and workers' medical information.",
        "safetyQrResult": "System implemented that significantly reduces access time to vital information in emergencies, increasing the safety of industrial workers and potentially saving lives.",
        "mealTrackerSituation": "Users needed an easy and efficient way to log meals, track calories, and view statistics of their food consumption to achieve health and wellness goals.",
        "mealTrackerTask": "Develop an intuitive platform with an interactive dashboard, automatic calorie calculation, and a secure authentication system for personal nutrition management.",
        "mealTrackerAction": "I built a complete web application with a modern dashboard interface, meal logging system, automatic calorie calculation per item, visual statistics, and integrated OAuth authentication via Google using AuthJS for security and ease of access.",
        "mealTrackerResult": "Functional platform that facilitates users' nutritional tracking, providing valuable insights through statistics and charts, helping them achieve their health goals in a more organized way.",
        "cobaltSituation": "An investment company needed a professional and optimized landing page to attract and convert qualified leads, clearly and convincingly showcasing their services.",
        "cobaltTask": "Create a high-performance landing page focused on conversion, with modern design and optimizations for SEO and loading speed.",
        "cobaltAction": "I developed a landing page using React focused on performance, implementing responsive design, image optimizations, lazy loading, and content structuring for maximum lead conversion rate.",
        "cobaltResult": "Landing page delivered with excellent performance, professional design that effectively communicates the company's services, resulting in greater engagement and conversion of qualified leads.",
        "coffeSituation": "A specialty coffee shop needed an e-commerce platform to sell their products online, offering a smooth and secure shopping experience for their customers.",
        "coffeTask": "Develop a complete online store with product catalog, shopping cart system, payment integration, and data validation to ensure secure transactions.",
        "coffeAction": "I implemented an online store using React with a responsive interface, functional shopping cart system, payment gateway integration, robust form validation, and user experience optimized for sales conversion.",
        "coffeResult": "Functional e-commerce that allows the store to sell specialty coffees online, providing customers with a secure and pleasant shopping experience, expanding the business reach beyond the physical store.",
        "droneSituation": "A drone store needed an attractive and efficient landing page to showcase their products, highlight offers, and facilitate contact with potential customers interested in drones.",
        "droneTask": "Create a modern and responsive landing page that presents products attractively, facilitates navigation, and maximizes visitor-to-customer conversion.",
        "droneAction": "I developed a landing page using React with modern and attractive design, responsive interface for all devices, clear organization of products and offers, and visual elements that highlight drone features in an impactful way.",
        "droneResult": "Landing page delivered with high conversion rate, professional design that efficiently showcases products, facilitating the purchasing process and increasing visitor engagement.",
        "appleSituation": "The goal was to create a redesign experience of the Apple website, maintaining the brand's visual essence while improving technical aspects such as performance and user experience.",
        "appleTask": "Redesign the Apple website interface focusing on performance, modern user experience, and maintaining the brand's iconic visual identity.",
        "appleAction": "I developed a complete redesign using modern web technologies, implementing smooth animations, optimized resource loading, responsive layout faithful to Apple's design, and improvements in navigation and interactivity.",
        "appleResult": "Successful redesign that captures Apple's elegance and minimalism, with significant improvements in performance and user experience, demonstrating skills in high-quality UI/UX design.",
        "showMore": "Show More",
        "viewInLive": "View In live",
        "starSituation": "Situation",
        "starTask": "Task",
        "starAction": "Action",
        "starResult": "Result",
        "stackTitleSection": "My Stack",
        "contactTitle": ". Contact",
        "contactCv": "My Cv:",
        "clikHere": "Click Here",
        "footerText": "powered"
      }
}