{
    "about": {
        "navSkills": "Habilidades",
        "navProjects": "Projetos",
        "navContact": "Contato",
        "homeHi": "Oi eu sou um desenvolvedor",
        "homeMarked": "Full Stack",
        "homeLeading": "criador de aplicativos web modernos.",
        "homeDescription": "Desenvolvedor full stack alocado no Brasil. Sou apaixonado por construir aplicativos web modernos usando Next.js e Node.js.",
        "homeButtonText": "Minhas Habilidades",
        "projectTitleSection": " Meus Projetos",
        "coffeDescription": "Loja online de cafés especiais desenvolvida com React. Interface responsiva com integração de pagamentos e validação de dados.",
        "cobaltDescription": "Landing page para empresa de investimentos desenvolvida com React. Página otimizada para performance e conversão de leads.",
        "droneDescription": "Landing page para loja de drones desenvolvida com React. Interface atrativa com alta taxa de conversão e fácil navegação.",
        "appleDescription": "Redesign do site da Apple mantendo a identidade da marca. Interface moderna com carregamento rápido e melhor experiência do usuário.",
        "raryDescription": "Site institucional desenvolvido com Next.js e Tailwind para a Rary Service. Aplicação escalável com SEO otimizado, autenticação e deploy na Vercel.",
        "safetyQrDescription": "Aplicação para segurança industrial com QR codes em capacetes. Acesso rápido a informações vitais em emergências, reduzindo tempo de reação e fatalidades.",
        "mealTrackerDescription": "Plataforma de registro de refeições com dashboard, cálculo automático de calorias e estatísticas. Autenticação via Google usando AuthJS.",
        "rarySituation": "A Rary Service precisava de um site institucional moderno e profissional para representar sua marca online, com necessidade de SEO otimizado, autenticação de usuários e uma arquitetura escalável.",
        "raryTask": "Desenvolver uma aplicação web completa que atendesse aos requisitos de design moderno, performance, SEO e segurança, utilizando tecnologias de ponta do ecossistema React.",
        "raryAction": "Implementei o site usando Next.js com App Router, Tailwind CSS para estilização responsiva, configurei autenticação segura, otimizei para SEO com meta tags dinâmicas, e fiz deploy na Vercel para máxima performance e escalabilidade.",
        "raryResult": "Site institucional entregue com sucesso, alcançando excelente performance, SEO otimizado, e uma experiência de usuário moderna que representa profissionalmente a marca Rary Service.",
        "safetyQrSituation": "A indústria precisa de um sistema rápido e eficiente para acessar informações vitais de segurança em situações de emergência, onde segundos podem significar a diferença entre vida e morte.",
        "safetyQrTask": "Criar uma solução que permita acesso instantâneo a informações de segurança através de QR codes em capacetes, reduzindo o tempo de resposta em emergências.",
        "safetyQrAction": "Desenvolvi uma aplicação web que gera QR codes únicos para cada capacete, permitindo acesso rápido via smartphone a dados críticos como alergias, contatos de emergência e informações médicas dos trabalhadores.",
        "safetyQrResult": "Sistema implementado que reduz significativamente o tempo de acesso a informações vitais em emergências, aumentando a segurança dos trabalhadores industriais e potencialmente salvando vidas.",
        "mealTrackerSituation": "Usuários precisavam de uma forma fácil e eficiente de registrar refeições, acompanhar calorias e visualizar estatísticas de seu consumo alimentar para alcançar objetivos de saúde e bem-estar.",
        "mealTrackerTask": "Desenvolver uma plataforma intuitiva com dashboard interativo, cálculo automático de calorias e sistema de autenticação seguro para gerenciamento pessoal de nutrição.",
        "mealTrackerAction": "Construí uma aplicação web completa com interface de dashboard moderna, sistema de registro de refeições, cálculo automático de calorias por item, estatísticas visuais, e integrei autenticação OAuth via Google usando AuthJS para segurança e facilidade de acesso.",
        "mealTrackerResult": "Plataforma funcional que facilita o acompanhamento nutricional dos usuários, fornecendo insights valiosos através de estatísticas e gráficos, ajudando-os a atingir seus objetivos de saúde de forma mais organizada.",
        "cobaltSituation": "Uma empresa de investimentos precisava de uma landing page profissional e otimizada para atrair e converter leads qualificados, destacando seus serviços de forma clara e convincente.",
        "cobaltTask": "Criar uma landing page de alta performance focada em conversão, com design moderno e otimizações para SEO e velocidade de carregamento.",
        "cobaltAction": "Desenvolvi uma landing page usando React com foco em performance, implementando design responsivo, otimizações de imagens, lazy loading, e estruturação de conteúdo para máxima taxa de conversão de leads.",
        "cobaltResult": "Landing page entregue com excelente performance, design profissional que comunica efetivamente os serviços da empresa, resultando em maior engajamento e conversão de leads qualificados.",
        "coffeSituation": "Uma loja de cafés especiais precisava de uma plataforma e-commerce para vender seus produtos online, oferecendo uma experiência de compra fluida e segura para seus clientes.",
        "coffeTask": "Desenvolver uma loja online completa com catálogo de produtos, sistema de carrinho de compras, integração de pagamentos e validação de dados para garantir transações seguras.",
        "coffeAction": "Implementei uma loja virtual usando React com interface responsiva, sistema de carrinho de compras funcional, integração com gateway de pagamento, validação robusta de formulários e experiência de usuário otimizada para conversão de vendas.",
        "coffeResult": "E-commerce funcional que permite à loja vender cafés especiais online, proporcionando aos clientes uma experiência de compra segura e agradável, expandindo o alcance do negócio para além da loja física.",
        "droneSituation": "Uma loja de drones precisava de uma landing page atrativa e eficiente para apresentar seus produtos, destacar ofertas e facilitar o contato com potenciais clientes interessados em drones.",
        "droneTask": "Criar uma landing page moderna e responsiva que apresente os produtos de forma atrativa, facilite a navegação e maximize a conversão de visitantes em clientes.",
        "droneAction": "Desenvolvi uma landing page usando React com design moderno e atraente, interface responsiva para todos os dispositivos, organização clara de produtos e ofertas, e elementos visuais que destacam as características dos drones de forma impactante.",
        "droneResult": "Landing page entregue com alta taxa de conversão, design profissional que apresenta eficientemente os produtos, facilitando o processo de compra e aumentando o engajamento dos visitantes.",
        "appleSituation": "O objetivo era criar uma experiência de redesign do site da Apple, mantendo a essência visual da marca enquanto melhorava aspectos técnicos como performance e experiência do usuário.",
        "appleTask": "Redesenhar a interface do site da Apple focando em performance, experiência do usuário moderna e mantendo a identidade visual icônica da marca.",
        "appleAction": "Desenvolvi um redesign completo usando tecnologias web modernas, implementando animações suaves, carregamento otimizado de recursos, layout responsivo fiel ao design da Apple, e melhorias na navegação e interatividade.",
        "appleResult": "Redesign bem-sucedido que captura a elegância e minimalismo da Apple, com melhorias significativas em performance e experiência do usuário, demonstrando habilidades em design UI/UX de alta qualidade.",
        "showMore": "ver mais",
        "viewInLive": "Ver ao vivo",
        "starSituation": "Situação",
        "starTask": "Tarefa",
        "starAction": "Ação",
        "starResult": "Resultado",
        "stackTitleSection": "Minha Stack",
        "contactTitle": "Meu Contato",
        "contactCv": "Meu curriculo",
        "clikHere": "Click Aqui",
        "footerText": "Criado por",
        "techStackTitle": "Stack de Tecnologias",
        "techStackDesc": "Construído com as ferramentas mais avançadas para performance e escala.",
        "activeProjects": "Projetos Ativos",
        "statusAvailable": "Disponível para Trabalho!!",
        "statusLimited": "Aceitando alguns Projetos",
        "statusUnavailable": "Indisponível no Momento",
        "localization": "Localização",
        "codingHours": "Horas de Código",
        "techStackLabel": "Tech Stack",
        "aboutTitle": "Sobre Mim"
    }
}